/-! PM II ✱116 opening; canonical Gutenberg 78255. -/
/- PM-VERBATIM-BEGIN PM2:✱116·01
✱116·01. α exp β = Prodʻα↓,,ʻʻβ Df
PM-VERBATIM-END PM2:✱116·01 -/
/- PM-VERBATIM-BEGIN PM2:✱116·02
✱116·02. μ^ν = γ̂{(∃α,β).μ=N₀cʻα.ν=N₀cʻβ.γ sm(α exp β)} Df
PM-VERBATIM-END PM2:✱116·02 -/
/- PM-VERBATIM-BEGIN PM2:✱116·03
✱116·03. (Ncʻα)^ν = (N₀cʻα)^ν Df
PM-VERBATIM-END PM2:✱116·03 -/
/- PM-VERBATIM-BEGIN PM2:✱116·04
✱116·04. μ^(Ncʻβ) = μ^(N₀cʻβ) Df
PM-VERBATIM-END PM2:✱116·04 -/
/- PM-VERBATIM-BEGIN PM2:✱116·1
✱116·1. ⊢ : ξ∈(α exp β) .≡. (∃R). R∈∈Δʻα↓,,ʻʻβ . ξ=DʻR
PM-VERBATIM-END PM2:✱116·1 -/
/- PM-VERBATIM-BEGIN PM2:✱116·11
✱116·11. ⊢ :: ξ∈(α exp β) .≡ : y∈β .⊃y. α∩x̂(x↓y∈ξ)∈1 : ξ⊂β×α

Dem.
 ⊢ .*113·111.*115·11.⊃
 ⊢ :. ξ ∈ (α exp β ). ≡ :ρ ∈ α ↓_,,ʻʻβ .⊃ _ρ .ρ ∩ ξ ∈ 1:ξ ⊂ sʻα ↓_,,ʻʻβ :
 [✱38·2.*113·1] ≡ :y∈ β .⊃ y.↓ yʻʻα ∩ ξ ∈ 1:ξ ⊂ β × α (1)
 ⊢ .*37·6.⊃
 ⊢ :↓ yʻʻα ∩ ξ ∈ 1. ≡ .R̂{(∃ x).x∈ α .R = x↓ y.R∈ ξ}∈ 1.
 [✱13·193] ≡ .R̂{(∃ x).x∈ α .x↓ y∈ ξ .R = x↓ y}∈ 1.
 [✱37·6] ≡ .↓ yʻʻx̂ (x∈ α .x↓ y∈ ξ )∈ 1.
 [✱73·611·44] ≡ .x̂ (x∈ α .x↓ y∈ ξ )∈ 1 (2)
 ⊢ .(1).(2).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·11 -/
/- PM-VERBATIM-BEGIN PM2:✱116·12
✱116·12. ⊢ . (α↑β)Δʻβ = R̂{R∈1→Cls.DʻR⊂α.ᴃʻR=β}

Dem.
 ⊢ .*80·14.⊃ ⊢ :R∈ (α ↑ β )_Δ ʻβ . ≡ .R∈ 1 arrow Cls.R ⪽ α ↑ β .ᗡʻR = β .
 [✱35·83] ≡ .R∈ 1 arrow Cls.DʻR⊂ α .ᗡʻR⊂ β .ᗡʻR = β .
 [✱22·42] ≡ .R∈ 1 arrow Cls.DʻR⊂ α .ᗡʻR = β :⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·12 -/
/- PM-VERBATIM-BEGIN PM2:✱116·13
✱116·13. ⊢ . sʻʻ(α exp β) = (α↑β)Δʻβ

Dem.
 ⊢ .*85·53.⊃ ⊢ .(α ↑ β )_Δ ʻβ = ṡʻʻDʻʻ∈_Δʻ(α ↑ β )↧ʻʻβ
 [✱113·103] = ṡʻʻDʻʻ∈_Δʻα ↓_,,ʻʻβ
 [✱115·1.(✱116·01)] = ṡʻʻ(α exp β ).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·13 -/
/- PM-VERBATIM-BEGIN PM2:✱116·131
✱116·131. ⊢ . ṡ↾(α exp β) ∈ {(α↑β)Δʻβ} sm̅̅ (α exp β)

Dem.
 ⊢ .*84·241.*113·103. ⊃ ⊢ .ιʻʻβ ∈ Cls² excl .α ↓_,,ʻʻβ = (α ↑ β )_Δ ʻʻιʻʻβ (1)
 ⊢ .(1).*85·42. ⊃ ⊢ :M,N∈ ∈_Δʻα ↓_,,ʻʻβ .ṡ ʻDʻM = ṡ ʻDʻN.⊃ .M = N.
 [✱30·37] ⊃ .DʻM = DʻN (2)
 ⊢ .(2).*37·63.*115·1.(✱116·01). ⊃ ⊢ :μ ,ν ∈ (α exp β ).ṡ ʻμ = ṡ ʻν .⊃ .μ = ν :
 [✱71·55.*72·163] ⊃ ⊢ .ṡ ↾ (α exp β )∈ 1 arrow 1 (3)
 ⊢ .(3).*116·13.⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·131 -/
/- PM-VERBATIM-BEGIN PM2:✱116·14
✱116·14. ⊢ . (α exp β) sm ∈Δʻα↓,,ʻʻβ
PM-VERBATIM-END PM2:✱116·14 -/
/- PM-VERBATIM-BEGIN PM2:✱116·15
✱116·15. ⊢ . (α exp β) sm (α↑β)Δʻβ
PM-VERBATIM-END PM2:✱116·15 -/
/- PM-VERBATIM-BEGIN PM2:✱116·151
✱116·151. ⊢ : x∈α .⊃. x↓|Cnvʻ(α↓,,↾β) ∈ ∈Δʻα↓,,ʻʻβ

Dem.
 ⊢ .*113·105.*72·184.⊃ ⊢ :Hp. ⊃ .x↓ | Cnvʻ(α ↓_,,↾ β ) ∈ 1 arrow Cls (1)
 ⊢ .*34·1.*38·1. ⊃ ⊢ :. Hp.⊃ :Rx↓ | Cnvʻ(α ↓_,,↾ β ) λ .≡ .
 (∃ y).R=x↓ y.y ∈ β . λ =α ↓_,,y.x ∈ α .
 [✱38·21] ⊃ .R ∈ λ (2)
 ⊢ .*37·322·401. ⊃ ⊢ .ᗡʻx↓ | Cnvʻ(α ↓_,,↾ β )=α ↓_,,ʻʻβ (3)
 ⊢ .(1).(2).(3).*80·14.⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·151 -/
/- PM-VERBATIM-BEGIN PM2:✱116·152
✱116·152. ⊢ : x∈α .⊃. x↓ʻʻβ ∈ (α exp β)

Dem.
 ⊢ .*37·32.*35·65. ⊃ ⊢ .Dʻx↓ | Cnvʻ(α ↓_,,↾ β )=x↓ʻʻβ (1)
 ⊢ .(1).*116·151·1. ⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·152 -/
/- PM-VERBATIM-BEGIN PM2:✱116·16
✱116·16. ⊢ . Cnvʻʻʻβ↓,,ʻʻα ⊂ α exp β

Dem.
 ⊢ .*116·152.*55·14.⊃ ⊢ :x ∈ α . ⊃ .Cnvʻʻ↓ xʻʻβ ∈ (α exp β ).
 [✱38·2] ⊃ .Cnvʻʻβ ↓_,,x ∈ (α exp β ):⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·16 -/
/- PM-VERBATIM-BEGIN PM2:✱116·17
✱116·17. ⊢ : ∃!β↓,,ʻʻα .⊃. ∃!α exp β
PM-VERBATIM-END PM2:✱116·17 -/
/- PM-VERBATIM-BEGIN PM2:✱116·171
✱116·171. ⊢ :: ∃!α .∨. β=Λ :⊃. ∃!α exp β

Dem.
 ⊢ .*113·113.*83·15.*51·161. ⊃ ⊢ :β =Λ .⊃ .∃ !α exp β (1)
 ⊢ .*116·152. ⊃ ⊢ :∃ !α .⊃ .∃ !α exp β (2)
 ⊢ .(1).(2).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·171 -/
/- PM-VERBATIM-BEGIN PM2:✱116·172
✱116·172. ⊢ :: ∃!α exp β .⊃: ∃!α .∨. β=Λ

Dem.
 ⊢ .*83·11.⊃ ⊢ :. Hp. ⊃ :Λ ∼∈ α ↓_,,ʻʻβ :
 [✱113·112] ⊃ :∼(α =Λ .∃ !β ):
 [✱24·51] ⊃ :∃ !α .∨.β =Λ :. ⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·172 -/
/- PM-VERBATIM-BEGIN PM2:✱116·18
✱116·18. ⊢ :: ∃!α .∨. β=Λ :≡. ∃!α exp β
PM-VERBATIM-END PM2:✱116·18 -/
/- PM-VERBATIM-BEGIN PM2:✱116·181
✱116·181. ⊢ . α exp Λ = ιʻΛ

Dem.
 ⊢ .*113·113.⊃ ⊢ .α exp Λ =ProdʻΛ
 [✱83·15.*33·241] =ι ʻΛ .⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·181 -/
/- PM-VERBATIM-BEGIN PM2:✱116·182
✱116·182. ⊢ : ∃!β .⊃. Λ exp β = Λ
PM-VERBATIM-END PM2:✱116·182 -/
/- PM-VERBATIM-BEGIN PM2:✱116·183
✱116·183. ⊢ . sʻ(α exp β) = β×α

Dem.
 ⊢ . ✱115·141 . ✱116·18 . ⊃ ⊢ :. ∃ ! α . ∨ . β = Λ : ⊃ . sʻ(α exp β ) = sʻα ↓_,,ʻʻβ
 [✱113·1] = β × α (1)
 ⊢ . ✱116·182 . ⊃ ⊢ :. α = Λ . ∃ ! β . ⊃ . sʻ(α exp β ) = Λ
 [✱113·114] = β × α (2)
 ⊢ . (1) . (2) . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·183 -/
/- PM-VERBATIM-BEGIN PM2:✱116·19
✱116·19. ⊢ : α sm γ . β sm δ .⊃. (α exp β) sm sm (γ exp δ)

Dem.
 ⊢ . ✱113·13 . ⊃ ⊢ : Hp . ⊃ . α ↓_,,ʻʻβ sm sm γ ↓_,,ʻʻδ .
 [✱115·51] ⊃ . (α exp β ) sm sm (γ exp δ ) : ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·19 -/
/- PM-VERBATIM-BEGIN PM2:✱116·191
✱116·191. Exponential correspondence under similarities.
PM-VERBATIM-END PM2:✱116·191 -/
/- PM-VERBATIM-BEGIN PM2:✱116·192
✱116·192. Restricted converse correspondence between exponentials.
PM-VERBATIM-END PM2:✱116·192 -/
/- PM-VERBATIM-BEGIN PM2:✱116·194
✱116·194. Exponential similarity is invariant under similar bases and exponents.

Dem.
 ⊢ . ✱116·12 . ⊃ ⊢ : Hp. ⊃ .sʻDʻʻ(γ ↑ δ )_Δ ʻδ ⊂ γ . sʻᗡʻʻ(γ ↑ δ )_Δ ʻδ ⊂ δ .
 [✱74·773 . ✱73·142] ⊃ . (R ∥ Š ) ↾ (γ ↑ δ )_Δ ʻδ ∈
 {(R ∥ Š )ʻʻ(γ ↑ δ )_Δ ʻδ} sm ̅ {(γ ↑ δ )_Δ ʻδ} (1)
 ⊢ . ✱116·192 . ✱111·14 . ⊃ ⊢ : Hp . ⊃ . α exp β = (R ∥ Š )_∈ʻʻ(γ exp δ ) .
 [✱116·13] ⊃ . (α ↑ β )_Δ ʻβ = ṡʻʻ(R ∥ Š )_∈ʻʻ(γ exp δ )
 [✱43·43] = (R ∥ Š )ʻʻṡʻʻ(γ exp δ )
 [✱116·13] = (R ∥ Š )ʻʻ(γ ↑ δ )_Δ ʻδ (2)
 ⊢ . (1) . (2) . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·194 -/
/- PM-VERBATIM-BEGIN PM2:✱116·2
✱116·2. ⊢ : ξ∈μ^ν .≡. (∃α,β). μ=N₀cʻα . ν=N₀cʻβ . ξ sm(α exp β)
PM-VERBATIM-END PM2:✱116·2 -/
/- PM-VERBATIM-BEGIN PM2:✱116·201
✱116·201. ⊢ :: ξ∈μ^ν .≡: μ,ν∈NC :(∃α,β).α∈μ.β∈ν.ξ sm(α exp β)
PM-VERBATIM-END PM2:✱116·201 -/
/- PM-VERBATIM-BEGIN PM2:✱116·202
✱116·202. ⊢ :: ξ∈μ^ν .≡: ∃!μ.∃!ν:(∃α,β).μ=Ncʻα.ν=Ncʻβ.ξ sm(α exp β)
[Proof as in ✱113·202]
PM-VERBATIM-END PM2:✱116·202 -/
/- PM-VERBATIM-BEGIN PM2:✱116·203
✱116·203. ⊢ : ∃!μ^ν .⊃. μ,ν∈NC−ιʻΛ . μ,ν∈N₀C
PM-VERBATIM-END PM2:✱116·203 -/
/- PM-VERBATIM-BEGIN PM2:✱116·204
✱116·204. ⊢ :: μ=Λ .∨. ν=Λ .∨. ∼(μ,ν∈NC) :⊃. μ^ν=Λ
PM-VERBATIM-END PM2:✱116·204 -/
/- PM-VERBATIM-BEGIN PM2:✱116·205
✱116·205. ⊢ : ∼(μ,ν∈N₀C) .⊃. μ^ν=Λ
PM-VERBATIM-END PM2:✱116·205 -/
/- PM-VERBATIM-BEGIN PM2:✱116·21
✱116·21. ⊢ :: μ,ν∈NC .⊃: ξ∈μ^ν .≡. (∃α,β).α∈μ.β∈ν.ξ sm(α exp β)
PM-VERBATIM-END PM2:✱116·21 -/
/- PM-VERBATIM-BEGIN PM2:✱116·22
✱116·22. ⊢ : ξ∈(Ncʻγ)^(Ncʻδ) .≡. ξ sm(γ exp δ)
[Proof as in ✱113·22, using ✱116·19 in place of ✱113·13]
PM-VERBATIM-END PM2:✱116·22 -/
/- PM-VERBATIM-BEGIN PM2:✱116·221
✱116·221. ⊢ . (Ncʻγ)^(Ncʻδ) = Ncʻ(γ exp δ)
PM-VERBATIM-END PM2:✱116·221 -/
/- PM-VERBATIM-BEGIN PM2:✱116·222
✱116·222. ⊢ . (N₀cʻγ)^(N₀cʻδ) = Ncʻ(γ exp δ)
[Proof as in ✱113·222]
PM-VERBATIM-END PM2:✱116·222 -/
/- PM-VERBATIM-BEGIN PM2:✱116·23
✱116·23. ⊢ . μ^ν∈NC
[Proof as in ✱113·23]
PM-VERBATIM-END PM2:✱116·23 -/
/- PM-VERBATIM-BEGIN PM2:✱116·24
✱116·24. ⊢ . (Ncʻγ)^(Ncʻδ) = (N₀cʻγ)^(N₀cʻδ)
PM-VERBATIM-END PM2:✱116·24 -/
/- PM-VERBATIM-BEGIN PM2:✱116·25
✱116·25. ⊢ . (Ncʻγ)^(Ncʻδ) = Ncʻ(γ exp δ)
PM-VERBATIM-END PM2:✱116·25 -/
/- PM-VERBATIM-BEGIN PM2:✱116·251
✱116·251. ⊢ . (γ exp δ)∈(Ncʻγ)^(Ncʻδ)
PM-VERBATIM-END PM2:✱116·251 -/
/- PM-VERBATIM-BEGIN PM2:✱116·26
✱116·26. ⊢ : μ,ν∈NC .⊃. μ^ν invariant under similarity images
[Proof as in ✱113·26]
PM-VERBATIM-END PM2:✱116·26 -/
/- PM-VERBATIM-BEGIN PM2:✱116·261
✱116·261. ⊢ : μ,ν∈NC .⊃. μ^ν={μ^(1)}^{ν^(1)}={μ_(00)}^{ν_(00)}=etc.
[Proof as in ✱113·261]
PM-VERBATIM-END PM2:✱116·261 -/
/- PM-VERBATIM-BEGIN PM2:✱116·27
✱116·27. ⊢ . μ^ν = ξ̂{(∃α,β).μ=N₀cʻα.ν=N₀cʻβ.ξ sm(α↑β)Δʻβ}
PM-VERBATIM-END PM2:✱116·27 -/
/- PM-VERBATIM-BEGIN PM2:✱116·271
✱116·271. ⊢ : μ,ν∈NC . α∈μ . β∈ν .⊃. (α exp β)∈μ^ν
PM-VERBATIM-END PM2:✱116·271 -/
/- PM-VERBATIM-BEGIN PM2:✱116·3
✱116·3. ⊢ . (Ncʻα)^0=1

Dem.
 ⊢ .*101·1.*116·25.⊃ ⊢ .(Ncʻα )⁰ = Ncʻ(α exp Λ )
 [✱116·181] = Ncʻι ʻΛ
 [✱101·2] = 1.⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·3 -/
/- PM-VERBATIM-BEGIN PM2:✱116·301
✱116·301. ⊢ : μ∈NC−ιʻΛ .⊃. μ^0=1
[Proof as in ✱113·601]
PM-VERBATIM-END PM2:✱116·301 -/
/- PM-VERBATIM-BEGIN PM2:✱116·31
✱116·31. ⊢ : β≠Λ .⊃. 0^(Ncʻβ)=0

Dem.
 ⊢ .*101·1.*116·25. ⊃ ⊢ .0^Ncʻβ = Ncʻ(Λ exp β )
 [✱116·182] ⊃ ⊢ :Hp.⊃ .0^Ncʻβ = NcʻΛ
 [✱101·1] = 0:⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·31 -/
/- PM-VERBATIM-BEGIN PM2:✱116·311
✱116·311. ⊢ : ν∈NC−ιʻΛ−ιʻ0 .⊃. 0^ν=0

Dem.
 ⊢ .*103·34.*101·1.⊃ ⊢ :Hp. ⊃ .(∃ β ).β ≠ Λ .ν =N₀cʻβ .
 [✱13·12·15] ⊃ .(∃ β ).β ≠ Λ .0^ν =0^N₀cʻβ
 [✱116·31.(✱116·04)] =0:⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·311 -/
/- PM-VERBATIM-BEGIN PM2:✱116·32
✱116·32. ⊢ . (Ncʻα)^1=Ncʻα

Dem.
 ⊢ .*116·25.*101·2.⊃ ⊢ .(Ncʻα )¹ =Ncʻα exp (ι ʻx)
 [(✱116·01)] =NcʻProdʻα ↓_,,ʻʻι ʻx
 [✱115·142.*53·31] =Ncʻι ʻʻα ↓_,,x
 [✱113·11.*100·6] =Ncʻα .⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·32 -/
/- PM-VERBATIM-BEGIN PM2:✱116·321
✱116·321. ⊢ . μ∈NC−ιʻΛ .⊃. μ^1=smʻʻμ
PM-VERBATIM-END PM2:✱116·321 -/
/- PM-VERBATIM-BEGIN PM2:✱116·33
✱116·33. ⊢ . 1^(Ncʻβ)=1

Dem.
 ⊢ .*113·11. ⊃ ⊢ :α ∈ 1. ⊃ .α ↓_,,ʻʻβ ⊂ 1.
 [✱115·144.*101·2] ⊃ .NcʻProdʻα ↓_,,ʻʻβ =1 (1)
 ⊢ .(1).*101·2. ⊃ ⊢ .Ncʻ(ι ʻx) exp β =1 (2)
 ⊢ .*101·2.*116·25. ⊃ ⊢ .1^Ncʻβ =Ncʻ{(ι ʻx) exp β} (3)
 ⊢ .(2).(3).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·33 -/
/- PM-VERBATIM-BEGIN PM2:✱116·331
✱116·331. ⊢ : μ∈NC−ιʻΛ .⊃. 1^μ=1

Dem.
 ⊢ .*103·34.⊃ ⊢ :Hp. ⊃ .(∃ β ).μ =N₀cʻβ .
 [✱13·12·15] ⊃ .(∃ β ).1^μ =1^N₀cʻβ .
 [(✱116·04)] ⊃ .(∃ β ).1^μ =1^Ncʻβ .
 [✱116·33] ⊃ .1^μ =1:⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·331 -/
/- PM-VERBATIM-BEGIN PM2:✱116·34
✱116·34. ⊢ . μ^2=μ×cμ

Dem.
 ⊢ .*24·1.*101·3.⊃ ⊢ .ι ʻΛ ∪ ι ʻV∈ 2.
 [✱116·222] ⊃ ⊢ :μ =N₀cʻα .⊃ .μ ²=NcʻProdʻα ↓_,,ʻʻ(ι ʻΛ ∪ ι ʻV)
 [✱53·32] =NcʻProdʻ(ι ʻα ↓_,,Λ ∪ ι ʻα ↓_,,V)
 [✱115·13.*55·233.*38·2] =Ncʻ(α ↓_,,Λ × α ↓_,,V)
 [✱113·11·25·13] =Ncʻα × cNcʻα
 [✱113·24] =μ × cμ (1)
 ⊢ .(1).*103·2. ⊃ ⊢ :μ ∈ N₀C.⊃ .μ ²=μ × cμ (2)
 ⊢ .*116·205. ⊃ ⊢ :μ ∼∈ N₀C.⊃ .μ ² =Λ
 [✱113·205] =μ × cμ (3)
 ⊢ .(2).(3).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·34 -/
/- PM-VERBATIM-BEGIN PM2:✱116·35
✱116·35. ⊢ : μ^ν=0 .≡. μ=0 . ν∈NC−ιʻ0−ιʻΛ

Dem.
 ⊢ .*116·311. ⊃ ⊢ :μ =0.ν ∈ NC-ι ʻ0-ι ʻΛ .⊃ .μ ^ν =0 (1)
 ⊢ .*101·12. ⊃ ⊢ :μ ^ν =0. ⊃ .∃ !μ ^ν .
 [✱116·203] ⊃ .μ ,ν ∈ NC-ι ʻΛ (2)
 ⊢ .(2)*116·21.*54·102. ⊃
 ⊢ :. μ ^ν =0. ⊃ :ξ =Λ .≡ .(∃ α ,β ).α ∈ μ .β ∈ ν .ξ sm (α exp β ):
 [✱73·47] ⊃ :(∃ α ,β ).α ∈ μ .β ∈ ν .α exp β =Λ :
 [✱116·18] ⊃ :(∃ α ,β ).α ∈ μ .β ∈ ν .α =Λ .β ≠ Λ :
 [✱13·195] ⊃ :Λ ∈ μ .ν ≠ ι ʻΛ .∃ !ν :
 [✱101·1.*100·45.(2)] ⊃ :μ =0.ν ∈ NC-ι ʻΛ -ι ʻ0 (3)
 ⊢ .(1).(3).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·35 -/
/- PM-VERBATIM-BEGIN PM2:✱116·351
✱116·351. ⊢ : μ∈NC−ιʻΛ . κ=Λ . ν=0 .⊃. μ^ν=ΠNcʻκ=1
PM-VERBATIM-END PM2:✱116·351 -/
/- PM-VERBATIM-BEGIN PM2:✱116·352
✱116·352. ⊢ : μ=0 . ν∈NC−ιʻΛ . κ∈ν . Λ∈κ .⊃. μ^ν=ΠNcʻκ=0
PM-VERBATIM-END PM2:✱116·352 -/
/- PM-VERBATIM-BEGIN PM2:✱116·353
✱116·353. ⊢ : μ=0 . ν∈NC−ιʻΛ . κ∈ν∩Clʻμ .⊃. μ^ν=ΠNcʻκ

Dem.
 ⊢ .*60·362.*54·1. ⊃ ⊢ :. Hp.⊃ :κ =Λ .∨.κ =ι ʻΛ (1)
 ⊢ .*100·45.*101·1.⊃ ⊢ :Hp.κ =Λ . ⊃ .ν =0.
 [✱116·351] ⊃ .μ ^ν =Π Ncʻκ (2)
 ⊢ .*51·16. ⊃ ⊢ :Hp.κ =ι ʻΛ .⊃ .Λ ∈ κ .
 [✱116·352] ⊃ .μ ^ν =Π Ncʻκ (3)
 ⊢ .(1).(2).(3).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·353 -/
/- PM-VERBATIM-BEGIN PM2:✱116·36
✱116·36. ⊢ :: Mult ax .⊃: μ,ν∈NC−ιʻΛ . κ∈ν∩Clʻμ .⊃. ΠNcʻκ=μ^ν

Dem.
 ⊢ .*113·12.*100·45.⊃ ⊢ :μ ,ν ∈ NC.α ∈ μ .β ∈ ν .∃ !α .⊃ .α ↓_,,ʻʻβ ∈ ν ∩ Clʻμ (1)
 ⊢ .(1).*114·571. ⊃ ⊢ :. Mult ax.⊃ :
 μ ,ν ∈ NC.α ∈ μ .β ∈ ν .∃ !α .κ ∈ ν ∩ Clʻμ .⊃ .Π Ncʻκ =Π Ncʻα ↓_,,ʻʻβ
 [✱116·14.*114·1] =Ncʻ(α exp β )
 [✱116·271] =μ ^ν (2)
 ⊢ .(2).⊃ ⊢ :. Mult ax.⊃ :μ ,ν ∈ NC-ι ʻΛ .∃ !μ -ι ʻΛ .κ ∈ ν ∩ Clʻμ .⊃ .Π Ncʻκ =μ ^ν (3)
 ⊢ .*51·4.*54·1.⊃ ⊢ :μ ∈ NC-ι ʻΛ .∼∃ !μ -ι ʻΛ .⊃ .μ =0 (4)
 ⊢ .(4).*116·353.⊃
 ⊢ :μ ,ν ∈ Nc-ι ʻΛ .∼∃ !μ -ι ʻΛ .κ ∈ ν ∩ Clʻμ .⊃ .Π Ncʻκ =μ ^ν (5)
 ⊢ .(3).(5).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·36 -/
/- PM-VERBATIM-BEGIN PM2:✱116·361
✱116·361. Product and exponential cardinal identity under the multiplicative axiom.

Dem.
 ⊢ . ✱115·12 . ⊃ ⊢ : κ ∈ ν ∩ Cl exclʻμ . ⊃ . Prodʻκ ∈ Π Ncʻκ (1)
 ⊢ . (1) . ✱116·36 . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·361 -/
/- PM-VERBATIM-BEGIN PM2:✱116·4
✱116·4. Construction of W from a disjoint family of one-one relations.

Dem.
 ⊢ .*21·33.⊃ ⊢ :. Hp. ⊃ :xWP.xWQ.≡ .
 (∃ R,S,z,w).R,S∈ λ .x=Rʻz=Sʻw.P=R↓ z.Q=S↓ w.
 [✱33·43] ≡ .(∃ R,S,z,w).R,S∈ λ .x=Rʻz=Sʻw.x∈ DʻR∩ DʻS.
 P=R↓ z.Q=S↓ w.
 [Hp.*13·195] ⊃ .(∃ R,z,w).R∈ λ .x=Rʻz=Rʻw.P=R↓ z.Q=R↓ w.
 [✱71·532.*13·195] ⊃ .(∃ R,z).R∈ λ .x=Rʻz.P=R↓ z.Q=R↓ z.
 [✱13·172] ⊃ .P=Q (1)
 ⊢ .*21·33.⊃ ⊢ :. Hp.⊃ :xWP.yWP. ≡ .
 (∃ R,S,z,w).R,S∈ λ .x=Rʻz.y=Sʻw.P=R↓ z=Q↓ w.
 [✱55·202] ⊃ .(∃ R,S,z,w).R,S∈ λ .x=Rʻz.y=Sʻw.R=S.z=w.
 [✱13·22·172] ⊃ .x=y (2)
 ⊢ .*33·131.⊃ ⊢ :. Hp.⊃ :P∈ ᗡʻW. ≡ .(∃ x,R,z).R∈ λ .x=Rʻz.P=R↓ z.
 [✱71·411] ≡ .(∃ R,z).R∈ λ .z∈ ᗡʻR.P=R↓ z.
 [Hp] ≡ .(∃ R,z).R∈ λ .z∈ γ .P=R↓ z.
 [✱113·101] ≡ .P∈ γ × λ (3)
 ⊢ .*33·13. ⊃ ⊢ :. Hp.⊃ :x∈ DʻW. ≡ .(∃ P,R,z).R∈ λ .x=Rʻz.P=R↓ z.
 [✱55·12.*71·36] ≡ .(∃ R,z).R∈ λ .xRz.
 [✱41·11.*33·13] ≡ .x∈ Dʻṡ ʻλ (4)
 ⊢ .(1).(2).(3).(4).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·4 -/
/- PM-VERBATIM-BEGIN PM2:✱116·401
✱116·401. ⊢ : Hp ✱116·4 . T=ṡʻλ .⊃. T⃗ʻʻγ=W∈ʻʻλ↓,,ʻʻγ

Dem.
 ⊢ . ✱37·11·1 . ✱38·2 . ⊃ ⊢ :. Hp . z ∈ γ . ⊃ :
 x ∈ W_∈ ʻλ ↓_,, z . ≡ . (∃ R) . R ∈ λ . x W (R ↓ z) .
 [✱21·33] ≡ . (∃ R, S, w) . R, S ∈ λ . x = Sʻw . R ↓ z = S ↓ w .
 [✱55·202 . ✱13·22] ≡ . (∃ R) . R ∈ λ . x = Rʻz .
 [✱71·36] ≡ . (∃ R) . R ∈ λ . xRz .
 [✱41·11] ≡ . x (ṡ ʻλ ) z .
 [Hp . ✱32·18] ≡ . x ∈ T⃗ʻz (1)
 ⊢ . (1) . ✱37·68 . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·401 -/
/- PM-VERBATIM-BEGIN PM2:✱116·41
✱116·41. Family-product correspondence theorem.

Dem.
 ⊢ . ✱116·4·401 . ✱111·4 . ✱113·1 . ⊃ ⊢ : Hp . ⊃ . T⃗ʻʻγ sm sm λ ↓_,, ʻʻγ . (1)
 [✱111·44 . ✱40·5] ⊃ . Tʻʻγ sm γ × λ (2)
 ⊢ . ✱72·321 . ✱85·14 . ⊃ ⊢ : Hp . ⊃ . T ∈ Cls arrow 1 . Ncʻ∈_ΔʻT⃗ʻʻγ = NcʻT_Δ ʻγ (3)
 ⊢ . (3) . ✱84·51 . ⊃ ⊢ : Hp . ⊃ .T⃗ʻʻγ ∈ Cls² excl . (4)
 [✱115·12] ⊃ . Ncʻ∈_ΔʻT⃗ʻʻγ = NcʻProdʻT⃗ʻʻγ (5)
 ⊢ . (1) . ✱114·52 . ⊃ ⊢ : Hp . ⊃ . Ncʻ∈_ΔʻT⃗ʻʻγ = Ncʻ∈_Δʻλ ↓_,, ʻʻγ
 [✱116·14] = Ncʻ(λ exp γ ) (6)
 [✱116·25] = (Ncʻλ )^Ncʻγ (7)
 ⊢ . (1) . (2) . (3) . (4) . (5) . (6) . (7) . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·41 -/
/- PM-VERBATIM-BEGIN PM2:✱116·411
✱116·411. ⊢ : κ∈Cls² excl .⊃. NcʻProdʻT⃗ʻʻγ=Ncʻ(κ exp γ)=(Ncʻκ)^(Ncʻγ)

Dem.
 ⊢ . ✱73·03 . ⊃ ⊢ : Hp . ⊃ . Mʻʻκ ⊂ 1 arrow 1 . ᗡʻʻMʻʻκ ⊂ ι ʻγ (1)
 ⊢ . ✱111·16 . ⊃ ⊢ :. Hp . ⊃ : α , β ∈ κ . Mʻα = Mʻβ . ⊃ . α = β (2)
 ⊢ . ✱14·21 . ⊃ ⊢ :. Hp . ⊃ : α ∈ κ . ⊃ . E! Mʻα (3)
 ⊢ . (2) . (3) . ✱73·24 . ⊃ ⊢ : Hp . ⊃ . Mʻʻκ sm κ (4)
 ⊢ . ✱73·03 . ⊃ ⊢ :. Hp . ⊃ : α ∈ κ . ⊃ . DʻMʻα = α :
 [✱13·12] ⊃ : α , β ∈ κ . ∃ ! D ʻMʻα ∩ DʻMʻβ . ⊃ . ∃ ! α ∩ β .
 [✱84·11] ⊃ . α = β .
 [✱30·37 . (3)] ⊃ . Mʻα = Mʻβ :
 [✱37·63] ⊃ : R, S ∈ Mʻʻκ . ∃ ! DʻR ∩ DʻS . ⊃ . R = S (5)
 ⊢ . (1) . (4) . (5) . ✱116·41 Mʻʻκ/λ. ✱113·13 . ✱116·19 . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·411 -/
/- PM-VERBATIM-BEGIN PM2:✱116·412
✱116·412. Dual construction U from a disjoint family of one-one relations.
[Proof as in ✱116·4]
PM-VERBATIM-END PM2:✱116·412 -/
/- PM-VERBATIM-BEGIN PM2:✱116·413
✱116·413. ⊢ : Hp ✱116·412 .⊃. Dʻʻλ=U∈ʻʻγ↓,,ʻʻλ
[Proof as in ✱116·401]
PM-VERBATIM-END PM2:✱116·413 -/
/- PM-VERBATIM-BEGIN PM2:✱116·414
✱116·414. ⊢ : Hp ✱116·412 .⊃. (Dʻʻλ) sm sm (γ↓,,ʻʻλ)
PM-VERBATIM-END PM2:✱116·414 -/
/- PM-VERBATIM-BEGIN PM2:✱116·42
✱116·42. ⊢ . ΠNcʻDʻʻλ=(Ncʻγ)^(Ncʻλ)
PM-VERBATIM-END PM2:✱116·42 -/
/- PM-VERBATIM-BEGIN PM2:✱116·422
✱116·422. Indexed form of the family-product correspondence.

Dem.
 ⊢ . ✱116·42 Mʻʻδ/λ. ⊃
 ⊢ :. Mʻʻδ ⊂ 1 arrow 1 : R, S ∈ Mʻʻδ . ∃ ! DʻR ∩ DʻS . ⊃ _R, S . R = S : ᗡʻʻMʻʻδ ⊂ ι ʻγ :
 ⊃ . DʻʻMʻʻδ sm sm γ ↓_,,ʻʻMʻʻδ (1)
 ⊢ . ✱14·21 . ⊃ ⊢ :. Hp . ⊃ : w ∈ δ . ⊃ . E! Mʻw : (2)
 [✱33·43] ⊃ : δ ⊂ ᗡʻM :
 [✱73·15] ⊃ : (Mʻʻδ ) sm δ (3)
 ⊢ . ✱51·15 . ⊃ ⊢ :. Hp . ⊃ : w ∈ δ . ⊃ . ᗡʻMʻw ∈ ι ʻγ :
 [✱37·61] ⊃ : ᗡʻʻMʻʻδ ⊂ ι ʻγ (4)
 ⊢ . (2) . ✱30·37 . ⊃ ⊢ :. Hp . ⊃ : w,v ∈ δ . ∃ ! DʻMʻw ∩ DʻMʻv . ⊃ w,v . Mʻw = Mʻv :
 [✱37·63] ⊃ : R, S ∈ Mʻʻδ . ∃ ! DʻR ∩ DʻS . ⊃ _R, S . R = S (5)
 ⊢ . (1) . (4) . (5) . ⊃ ⊢ : Hp . ⊃ . DʻʻMʻʻδ sm sm γ ↓_,,ʻʻMʻʻδ .
 [(3) . ✱113·13] ⊃ . DʻʻMʻʻδ sm sm γ ↓_,,ʻʻδ : ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·422 -/
/- PM-VERBATIM-BEGIN PM2:✱116·43
✱116·43. ⊢ . ProdʻDʻʻMʻʻδ sm sm(γ exp δ)

Dem.
 ⊢ .*115·51.*116·422. ⊃ ⊢ :Hp.⊃ .ProdʻDʻʻMʻʻδ sm sm (γ exp δ ) (1)
 ⊢ .*116·422.*114·52. ⊃ ⊢ :Hp.⊃ .Π NcʻDʻʻMʻʻδ = Π Ncʻγ ↓_,,ʻʻδ (2)
 ⊢ .*116·14·25. ⊃ ⊢ .Π Ncʻγ ↓_,,ʻʻδ = (Ncʻγ )^Ncʻδ (3)
 ⊢ .(1).(2).(3).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·43 -/
/- PM-VERBATIM-BEGIN PM2:✱116·44
✱116·44. Restricted-domain form of the family-product correspondence.

Dem.
 ⊢ .*71·29.*35·65.⊃
 ⊢ :. Hp:(z).Nʻz = (Mʻz)↾ γ :⊃ .(z).Nʻz∈ 1 arrow 1.ᗡʻNʻz = γ (1)
 ⊢ .*37·401.⊃ ⊢ :. Hp.Hp(1).⊃ :w,v∈ δ .∃ !DʻNʻw∩ DʻNʻv.⊃ w,v.w = v (2)
 ⊢ .*35·7.⊃ ⊢ :. Hp.Hp(1).⊃ :x∈ γ .w,v∈ δ .Nʻw = Nʻv.⊃ .(Nʻw)ʻx = (Nʻv)ʻx.
 [(2)] ⊃ .w = v (3)
 ⊢ .(3).*10·11·23·35.⊃ ⊢ :. Hp.Hp(1).⊃ :w,v∈ δ .Nʻw = Nʻv.⊃ .w = v:
 [✱71·55·166] ⊃ :N↾ δ ∈ 1 arrow 1 (4)
 ⊢ .(1).(2).(4).*116·422.*115·51.⊃
 ⊢ :Hp.Hp(1).⊃ .DʻʻNʻʻδ sm sm γ ↓_,,ʻʻδ .ProdʻDʻʻNʻʻδ sm sm (γ exp δ ) (5)
 ⊢ .*38·11.⊃ ⊢ :Hp.Hp(1).⊃ .DʻNʻz = Dʻ↾ γ ʻMʻz.
 [✱37·353] ⊃ .DʻʻNʻʻδ = Dʻʻ↾ γ ʻʻMʻʻδ (6)
 ⊢ .(5).(6).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·44 -/
/- PM-VERBATIM-BEGIN PM2:✱116·45
✱116·45. Restricted product is similar to γ exp δ.

Dem.
 ⊢ .*116·182.*115·142.*37·29.⊃
 ⊢ :Hp.γ = Λ .∃ !δ .⊃ .ProdʻDʻʻ↾ γ ʻʻMʻʻδ = Λ .γ exp δ = Λ (1)
 ⊢ .*115·1.*83·15.*116·181.⊃
 ⊢ :Hp.δ = Λ .⊃ .ProdʻDʻʻ↾ γ ʻʻMʻʻδ = ι ʻΛ .γ exp δ = ι ʻΛ (2)
 ⊢ .(1).(2).*116·44.⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·45 -/
/- PM-VERBATIM-BEGIN PM2:✱116·5
✱116·5. Canonical correspondence for exponentials over a disjoint sum.

Dem.
 ⊢ . ✱113·191 . ⊃
 ⊢ : Hp . ∃ ! α . ⊃ . α ↓_,,ʻʻβ ∩ α ↓_,,ʻʻγ = Λ .
 [✱114·301] ⊃ . ∈_Δʻα ↓_,,ʻʻβ × ∈_Δʻα ↓_,,ʻʻγ sm ∈_Δʻ(α ↓_,,ʻʻβ ∪ α ↓_,,ʻʻγ .
 [✱116·14 . ✱113·13] ⊃ . (α exp β ) × (α exp γ ) sm ∈_Δʻ(α ↓_,,ʻʻβ ∪ α ↓_,,ʻʻγ ) .
 [✱37·22] ⊃ . (α exp β ) × (α exp γ ) sm ∈_Δʻα ↓_,,ʻʻ(β ∪ γ ) .
 [✱116·14] ⊃ . (α exp β ) × (α exp γ ) sm α exp (β ∪ γ ) (1)
 ⊢ . ✱116·182 . ⊃ ⊢ : α = Λ . ∃ ! β . ⊃ . α exp β = Λ .
 [✱113·114] ⊃ . (α exp β ) × (α exp γ ) = Λ (2)
 ⊢ . ✱116·182 . ✱24·56 . ⊃ ⊢ : α = Λ . ∃ ! β . ⊃ . α exp (β ∪ γ ) = Λ (3)
 ⊢ . (2) . (3) . ⊃ ⊢ : α = Λ . ∃ ! β . ⊃ . (α exp β ) × (α exp γ ) sm α exp (β ∪ γ ) (4)
 Similarly ⊢ : α = Λ . ∃ ! γ . ⊃ . (α exp β ) × (α exp γ ) sm α exp (β ∪ γ ) (5)
 ⊢ . ✱116·181 . ⊃ ⊢ : α = Λ . β = Λ . γ = Λ . ⊃ . (α exp β ) × (α exp γ ) = ι ʻΛ × ι ʻΛ (6)
 ⊢ . ✱116·181 . ⊃ ⊢ : α = Λ . β = Λ . γ = Λ . ⊃ . α exp (β ∪ γ ) = ι ʻΛ (7)
 ⊢ . (6) . (7) . ✱113·611 . ✱73·43 . ⊃
 ⊢ : α = Λ . β = Λ . γ = Λ . ⊃ . (α exp β ) × (α exp γ ) sm α exp (β ∪ γ ) (8)
 ⊢ . (1) . (4) . (5) . (8) . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·5 -/
/- PM-VERBATIM-BEGIN PM2:✱116·51
✱116·51. ⊢ . (α exp β)×(α exp γ) sm α exp(β+γ)

Dem.
 ⊢ . ✱116·19 . ✱110·12 . ⊃ ⊢ . (α exp β ) sm (α exp ↓ Λ _γ ʻʻι ʻʻβ ) .
 (α exp γ ) sm (α exp Λ _β ↓ ʻʻιʻʻγ ) .
 [✱113·13] ⊃ ⊢ . (α exp β ) × (α exp γ ) sm
 (α exp ↓ Λ _γ ʻʻιʻʻβ ) × (α exp Λ _β ↓ ʻʻιʻʻγ ) .
 [✱110·11 . ✱116·5] ⊃ ⊢ . (α exp β ) × (α exp γ ) sm
 α exp (↓ Λ _γ ʻʻιʻʻβ ∪ Λ _β ↓ ʻʻιʻʻγ ) (1)
 ⊢ . (1) . (✱110·01) . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·51 -/
/- PM-VERBATIM-BEGIN PM2:✱116·52
✱116·52. ⊢ . μ^ν ×c μ^ϖ = μ^(ν+cϖ)

Dem.
 ⊢ .*116·51 .*110·22.⊃
 ⊢ .(N₀cʻα )^N₀cʻβ × c (N₀cʻα )^N₀cʻγ = (N₀cʻα )^N₀cʻβ +c N₀cʻγ (1)
 ⊢ .(1).*103·2.⊃ ⊢ :μ ,ν ,ϖ ∈ N₀C.⊃ .μ ^ν × c μ ^ϖ = μ ^ν +cϖ (2)
 ⊢ .*116·205.*113·204.⊃
 ⊢ : μ ∼ ∈ N₀C.⊃ .μ ^ν × c μ ^ϖ = Λ = μ ^ν +cϖ (3)
 ⊢ .*116·205.*113·204.⊃
 ⊢ : ∼ (ν ,ϖ ∈ N₀C).⊃ .μ ^ν × c μ ^ϖ = Λ (4)
 ⊢ .*110·4.*116·204.⊃ ⊢ :∼(ν ,ϖ ∈ N₀C).⊃ .μ ^ν +cϖ = Λ (5)
 ⊢ . (4).(5).⊃ ⊢ :∼(ν ,ϖ ∈ N₀C).⊃ .μ ^ν × c μ ^ϖ = μ ^ν +cϖ (6)
 ⊢ .(2).(3).(6).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·52 -/
/- PM-VERBATIM-BEGIN PM2:✱116·529
✱116·529. R† = R∥converse R Dft
PM-VERBATIM-END PM2:✱116·529 -/
/- PM-VERBATIM-BEGIN PM2:✱116·53
✱116·53. ⊢ . (α exp γ)×(β exp γ) sm pointwise products

Dem.
 ⊢ .*113·104·111. ⊃ ⊢ .γ ⊂ ᗡʻα ↓_,,.γ ⊂ ᗡʻβ ↓_,,.α ↓_,,ʻʻγ ,β ↓_,,ʻʻγ ∈ Cls² excl (1)
 ⊢ .*113·105. ⊃ ⊢ :Hp.⊃ .(α ↓_,,ʻʻγ )↿ α ↓_,,, β ↓_,,↾ γ ∈ 1 arrow 1 (2)
 ⊢ .(1).(2).*115·6 α ↓_,,, β ↓_,,/R, S.⊃
 ⊢ : Hp. ⊃ .(α exp γ ) × (β exp γ ) sm ∈_Δʻμ̂{(∃ z).z∈ γ .μ = α ↓_,,z × β ↓_,,z} (3)
 ⊢ .(3).*38·2.⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·53 -/
/- PM-VERBATIM-BEGIN PM2:✱116·531
✱116·531. Definition and properties of the pointwise product relation M.

Dem.
 ⊢ .*74·772.*55·12.*72·184 . ⊃ ⊢ .(↓ z)† ∈ 1 arrow 1 (1)
 ⊢ .*21·33. ⊃ ⊢ :. Hp.z∈ γ .⊃ :RMz. ≡ .R = (↓ z)† ↾ (α × β ):
 [✱30·3] ⊃ :Mʻz = (↓ z)† ↾ (α × β ): (2)
 [(1).*43·122] ⊃ :Mʻz∈ 1 arrow 1.ᗡʻMʻz = α × β (3)
 ⊢ .(2).(3).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·531 -/
/- PM-VERBATIM-BEGIN PM2:✱116·532
✱116·532. ⊢ : Hp ✱116·531 .⊃. M∈1→1 . ᴃʻM=γ

Dem.
 ⊢ .*116·531.*14·21.*71·16. ⊃ ⊢ :Hp.⊃ .M∈ 1 arrow Cls (1)
 ⊢ . ✱116·531.⊃ ⊢ :. Hp.z,w∈ γ .Mʻz = Mʻw.⊃ :
 (↓ z)† ↾ (α × β ) = (↓ w)† ↾ (α × β ):
 [✱71·35] ⊃ :R∈ (α × β ).⊃ .(↓ z)† ʻR = (↓ w)† ʻR:
 [✱113·101] ⊃ :x∈ α .y∈ β . ⊃ .(↓ z)† ʻ(y↓ x) = (↓ w)† ʻ(y↓ x).
 [✱113·123] ⊃ .(y↓ z)↓ (x↓ z) = (y↓ w)↓ (x↓ w).
 [✱55·202] ⊃ .z = w (2)
 ⊢ .(2). ⊃ ⊢ :. Hp.⊃ :z,w∈ γ .Mʻz = Mʻw.⊃ .z = w (3)
 ⊢ .*116·531.*14·21.*33·43. ⊃ ⊢ :Hp.z∈ γ .⊃ .z∈ ᗡʻR (4)
 ⊢ .*21·33. ⊃ ⊢ :. Hp.⊃ :RMz.⊃ _R,z.z∈ γ :
 [✱33·351] ⊃ :ᗡʻR⊂ γ (5)
 ⊢ .(1).(3).(4).(5).*71·55.⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·532 -/
/- PM-VERBATIM-BEGIN PM2:✱116·533
✱116·533. M transports pairs of exponential members pointwise.

Dem.
 ⊢ .*116·531.⊃ ⊢ :Hp.z∈ γ .⊃ .DʻMʻz = Dʻ{(↓ z)† ↾ (α × β )}
 [✱37·401] = (↓ z)† ʻʻ(α × β )
 [✱113·65] = ↓ zʻʻα × ↓ zʻʻβ (1)
 ⊢ .(1).*37·6. ⊃ ⊢ :Hp.⊃ .DʻʻMʻʻγ = μ̂ {(∃ z).z∈ γ .μ = ↓ zʻʻα × ↓ zʻʻβ} (2)
 ⊢ .*113·19.⊃ ⊢ : ∃ !(↓ zʻʻα × ↓ zʻʻβ )∩ (↓ wʻʻα × ↓ wʻʻβ ).⊃ .
 ∃ !↓ zʻʻα ∩ ↓ wʻʻα .
 [✱55·232] ⊃ .z = w (3)
 ⊢ .(1).(2).(3).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·533 -/
/- PM-VERBATIM-BEGIN PM2:✱116·534
✱116·534. ⊢ : Hp ✱116·532 .⊃. ∈ΔʻDʻʻMʻʻγ sm(α×β) exp γ

Dem.
 ⊢ .*116·531·532·533.⊃
 ⊢ :. Hp.⊃ :M∈ 1 arrow 1:z,w∈ γ . ∃ !DʻMʻz∩ DʻMʻw.⊃ z,ω .z = w:
 z∈ γ .⊃ z.Mʻz∈ 1 arrow 1.ᗡʻMʻz = α × β :
 [✱116·43] ⊃ :ProdʻDʻʻMʻʻγ sm (α × β ) exp γ :
 [✱115·12.*30·37.*84·11] ⊃ :∈_ΔʻDʻʻMʻʻγ sm (α × β ) exp γ :. ⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·534 -/
/- PM-VERBATIM-BEGIN PM2:✱116·535
✱116·535. The pointwise construction is one-one and onto.
PM-VERBATIM-END PM2:✱116·535 -/
/- PM-VERBATIM-BEGIN PM2:✱116·54
✱116·54. ⊢ . (α exp γ)×(β exp γ) sm(α×β) exp γ

Dem.
 ⊢ .*116·182.⊃ ⊢ :α = Λ .∃ !γ . ⊃ .α exp γ = Λ .
 [✱113·114] ⊃ .(α exp γ ) × (β exp γ ) = Λ (1)
 ⊢ .*113·114.*116·182. ⊃ ⊢ :α = Λ .∃ !γ .⊃ .(α × β ) exp γ = Λ (2)
 ⊢ .(1).(2). ⊃ ⊢ :α = Λ .∃ !γ .⊃ .(α exp γ ) × (β exp γ ) sm (α × β ) exp γ (3)
 Similarly ⊢ :β = Λ .∃ !γ .⊃ .(α exp γ ) × (β exp γ ) sm (α × β ) exp γ (4)
 ⊢ .*116·181. ⊃ ⊢ :γ = Λ . ⊃ .(α exp γ ) × (β exp γ ) = ι ʻΛ × ι ʻΛ .
 [✱113·611.*73·43] ⊃ .(α exp γ ) × (β exp γ ) sm ι ʻΛ (5)
 ⊢ .*116·181. ⊃ ⊢ :γ = Λ . ⊃ .(α × β ) exp γ = ι ʻΛ .
 [(5)] ⊃ .(α exp γ ) × (β exp γ ) sm (α × β ) exp γ (6)
 ⊢ .(3).(4).(6).*116·535. ⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·54 -/
/- PM-VERBATIM-BEGIN PM2:✱116·55
✱116·55. ⊢ . μ^ϖ×cν^ϖ=(μ×cν)^ϖ

Dem.
 ⊢ .*116·54·222.*113·222. ⊃ ⊢ .(N₀cʻα )^N₀cʻγ × c (N₀cʻβ )^N₀cʻγ
 =(N₀cʻα × c N₀cʻβ )^N₀cʻγ (1)
 ⊢ .(1).*103·2. ⊃ ⊢ :μ ,ν ,ϖ ∈ N₀C.⊃ .μ ^ϖ × c ν ^ϖ = (μ × c ν )^ϖ (2)
 ⊢ .*116·205.*113·204. ⊃ ⊢ :ϖ ∼∈ N₀C.⊃ .μ ^ϖ × c ν ^ϖ = Λ = (μ × c ν )^ϖ (3)
 ⊢ .*116·205.*113·204. ⊃ ⊢ :∼(μ ,ν ∈ N₀C).⊃ .μ ^ϖ × c ν ^ϖ = Λ (4)
 ⊢ .*113·204.*116·204. ⊃ ⊢ :∼(μ ,ν ∈ N₀C).⊃ .(μ × c ν )^ϖ = Λ (5)
 ⊢ .(4).(5) ⊃ ⊢ :∼(μ ,ν ∈ N₀C).⊃ .μ ^ϖ × c ν ^ϖ = (μ × c ν )^ϖ (6)
 ⊢ .(2).(3).(6). ⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·55 -/
/- PM-VERBATIM-BEGIN PM2:✱116·6
✱116·6. ⊢ . α exp(β×γ) sm ProdʻProdʻʻα↓,,ʻʻʻβ↓,,ʻγ

Dem.
 ⊢ .*113·105.*84·53 α ↓_,,/R.*113·111. ⊃ ⊢ :Hp.⊃ .α ↓_,,ʻʻʻβ ↓_,,ʻʻγ ∈ Cls² excl (1)
 ⊢ .*40·38. ⊃ ⊢ .sʻα ↓_,,ʻʻʻβ ↓_,,ʻʻγ = α ↓_,,ʻʻsʻβ ↓_,,ʻʻγ (2)
 [✱113·111] ⊃ ⊢ .sʻα ↓_,,ʻʻʻβ ↓_,,ʻʻγ ∈ Cls² excl (3)
 ⊢ .(1).(3).*115·2. ⊃ ⊢ :Hp.⊃ .α ↓_,,ʻʻʻβ ↓_,,ʻʻγ ∈ Cls³ arithm (4)
 ⊢ .*113·141.*116·19. ⊃ ⊢ . Ncʻ{α exp (β × γ )} = Ncʻ{α exp (γ × β )}
 [(✱116·01.*113·02)] = NcʻProdʻα ↓_,,ʻʻsʻβ ↓_,,ʻʻγ
 [(2)] = NcʻProdʻsʻα ↓_,,ʻʻʻβ ↓_,,ʻʻγ
 [✱115·35.(4)] = NcʻProdʻProdʻʻα ↓_,,ʻʻʻβ ↓_,,ʻʻγ (5)
 ⊢ .(4).(5).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·6 -/
/- PM-VERBATIM-BEGIN PM2:✱116·601
✱116·601. ⊢ . |(Cnvʻ↓z)∈1→1
PM-VERBATIM-END PM2:✱116·601 -/
/- PM-VERBATIM-BEGIN PM2:✱116·602
✱116·602. Definition of the family M of restricted converse projections.

Dem.
 ⊢ .*21·33.⊃
 ⊢ :: Hp.⊃ :. z∈ γ .⊃ :RMz. ≡ .R = | (Cnvʻ↓ z)_∈ ↾ (α exp β ) (1)
 ⊢ .(1).*30·3.⊃ ⊢ :. Hp.⊃ :z∈ γ .⊃ .Mʻz = | (Cnvʻ↓ z)_∈ ↾ (α exp β ) (2)
 ⊢ .*21·33.*33·131.⊃ ⊢ :Hp.⊃ .ᗡʻM = γ (3)
 ⊢ .(2).(3).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·602 -/
/- PM-VERBATIM-BEGIN PM2:✱116·603
✱116·603. ⊢ : Hp ✱116·602 . z∈γ .⊃. ᴃʻMʻz=α exp β
PM-VERBATIM-END PM2:✱116·603 -/
/- PM-VERBATIM-BEGIN PM2:✱116·604
✱116·604. ⊢ : Hp ✱116·602 . z∈γ .⊃. DʻMʻz=Prodʻα↓,,ʻʻβ↓,,z

Dem.
 ⊢ .*37·401.*116·602.⊃
 ⊢ :Hp.z∈ γ .⊃ .DʻMʻz = {| (Cnvʻ↓ z)}_∈ʻʻ(α exp β )
 [✱115·4.*116·601.*43·301] = Prodʻ{| (Cnvʻ↓ z)}_∈ʻʻα ↓_,,ʻʻβ
 [✱113·125 I/R.*50·75·16] = Prodʻα ↓_,,ʻʻ↓ zʻʻβ
 [✱38·2] = Prodʻα ↓_,,ʻʻβ ↓_,,z:⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·604 -/
/- PM-VERBATIM-BEGIN PM2:✱116·605
✱116·605. ⊢ : Hp ✱116·602 . z∈γ .⊃. Mʻz∈1→1

Dem.
 ⊢ .*116·601.*72·451.⊃
 ⊢ .| (Cnvʻ↓ z)_∈ ↾ Clʻᗡʻ| (Cnvʻ↓ z)∈ 1 arrow 1.
 [✱43·301]⊃ ⊢ .| (Cnvʻ↓ z)_∈ ↾ (α exp β )∈ 1 arrow 1 (1)
 ⊢ .(1).*116·602.⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·605 -/
/- PM-VERBATIM-BEGIN PM2:✱116·606
✱116·606. ⊢ : Hp ✱116·602 .⊃. M∈1→1 and distinct fibres have distinct domains

Dem.
 ⊢ .*116·602.*14·21. ⊃ ⊢ :. Hp.⊃ :z∈ ᗡʻM.⊃ z.E!Mʻz:
 [✱71·16] ⊃ :M∈ 1 arrow Cls (1)
 ⊢ .*30·37. ⊃ ⊢ :. Hp.⊃ :z,w∈ γ .Mʻz = Mʻw.⊃ .DʻMʻz = DʻMʻw (2)
 ⊢ .*116·604. ⊃ ⊢ :. Hp.⊃ :z,w∈ γ .DʻMʻz = DʻMʻw.⊃ .
 Prodʻα ↓_,,ʻʻβ ↓_,,z = Prodʻα ↓_,,ʻʻβ ↓_,,w.
 [✱30·37] ⊃ .sʻProdʻα ↓_,,ʻʻβ ↓_,,z = sʻProdʻα ↓_,,ʻʻβ ↓_,,w.
 [✱116·171.*115·141.(✱116·01)] ⊃ .sʻα ↓_,,ʻʻβ ↓_,,z = sʻα ↓_,,ʻʻβ ↓_,,w.
 [✱113·1] ⊃ .β ↓_,,z × α = β ↓_,,w × α .
 [✱113·182] ⊃ .β ↓_,,z = β ↓_,,w.
 [✱113·105.Hp] ⊃ .z = w (3)
 ⊢ .(1).(2).(3).*71·55.*116·602.⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·606 -/
/- PM-VERBATIM-BEGIN PM2:✱116·607
✱116·607. ⊢ : Hp ✱116·602 .⊃. DʻʻMʻʻγ=Prodʻʻα↓,,ʻʻʻβ↓,,ʻγ
PM-VERBATIM-END PM2:✱116·607 -/
/- PM-VERBATIM-BEGIN PM2:✱116·61
✱116·61. ⊢ . ProdʻProdʻʻα↓,,ʻʻʻβ↓,,ʻγ sm(α exp β) exp γ
PM-VERBATIM-END PM2:✱116·61 -/
/- PM-VERBATIM-BEGIN PM2:✱116·611
✱116·611. ⊢ . α exp(β×γ) sm(α exp β) exp γ
PM-VERBATIM-END PM2:✱116·611 -/
/- PM-VERBATIM-BEGIN PM2:✱116·62
✱116·62. ⊢ . α exp(β×γ) sm(α exp β) exp γ

Dem.
 ⊢ .*116·181.*113·114. ⊃ ⊢ :β = Λ .⊃ .α exp (β × γ ) = ι ʻΛ (1)
 ⊢ .*116·181. ⊃ ⊢ :β = Λ .⊃ .(α exp β ) exp γ = (ι ʻΛ ) exp γ (2)
 ⊢ .*116·33·25. ⊃ ⊢ .Ncʻ{(ι ʻΛ ) exp γ}= 1 (3)
 ⊢ . (1).(2).(3).*55·22.*100·31. ⊃ ⊢ :β = Λ .⊃ .α exp (β × γ ) sm (α exp β ) exp γ (4)
 ⊢ . ✱113·107.*116·182. ⊃ ⊢ :α = Λ .∃ !β .∃ !γ .⊃ .α exp (β × γ ) = Λ (5)
 ⊢ .*116·182. ⊃ ⊢ :α = Λ .∃ !β .∃ !γ .⊃ .(α exp β ) exp γ = Λ (6)
 ⊢ .(5).(6). ⊃ ⊢ :α = Λ .∃ !β .∃ !γ .⊃ .α exp (β × γ ) sm (α exp β ) exp γ (7)
 ⊢ .*113·114.*116·181. ⊃ ⊢ :γ = Λ .⊃ .α exp (β × γ ) = ι ʻΛ .(α exp β ) exp γ = ι ʻΛ .
 [✱73·43] ⊃ .α exp (β × γ ) sm (α exp β ) exp γ (8)
 ⊢ .(4).(7).(8). ⊃ ⊢ :. α = Λ .∨.β = Λ .∨.γ = Λ :⊃ .
 α exp (β × γ ) sm (α exp β ) exp γ (9)
 ⊢ .(9).*116·611.⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·62 -/
/- PM-VERBATIM-BEGIN PM2:✱116·63
✱116·63. ⊢ . μ^(ν×cϖ)=(μ^ν)^ϖ

Dem.
 ⊢ . ✱113·222 . ⊃ ⊢ . (N₀cʻα )^N₀cʻβ × c N₀cʻγ = (N₀cʻα )^Ncʻ(β × γ )
 [✱116·222 . (✱116·04)] = Ncʻ{α exp (β × γ )}
 [✱116·62] = Ncʻ{(α exp β ) exp γ}
 [✱116·222] = {N₀cʻ(α exp β )}^N₀cʻγ
 [✱116·222 . (✱116· 03)] = {(N₀cʻα )^N₀cʻβ }^N₀cʻγ (1)
 ⊢ . (1) . ✱103·2 . ⊃ ⊢ : μ , ν , ϖ ∈ N₀C . ⊃ . μ ^ν × c ϖ = (μ ^ν )^ϖ (2)
 ⊢ . ✱116·204·205 . ⊃ ⊢ : ∼ (μ , ν ∈ N₀C) . ⊃ . (μ ^ν )^ϖ = Λ (3)
 ⊢ . ✱113·205 . ✱116·204·205 . ⊃ ⊢ : ∼(μ , ν ∈ N₀C) . ⊃ . μ ^ν × c ϖ = Λ (4)
 ⊢ . ✱116·205 . ⊃ ⊢ : ϖ ∼ ∈ N₀C . ⊃ . (μ ^ν )^ϖ = Λ (5)
 ⊢ . ✱113·205 . ✱116·204 . ⊃ ⊢ : ϖ ∼ ∈ N₀C . ⊃ . μ ^ν × c ϖ = Λ (6)
 ⊢ . (3) . (4) . (5) . (6) . ⊃ ⊢ : ∼ (μ , ν , ϖ ∈ N₀C) . ⊃ . μ ^ν × c ϖ = (μ ^ν )^ϖ (7)
 ⊢ . (2) . (7) . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·63 -/
/- PM-VERBATIM-BEGIN PM2:✱116·64
✱116·64. ⊢ . (μ^ν)^ϖ=(μ^ϖ)^ν
PM-VERBATIM-END PM2:✱116·64 -/
/- PM-VERBATIM-BEGIN PM2:✱116·651
✱116·651. Distribution of relational choice over a disjoint family.

Dem.
 ⊢ . ✱84·53 . ⊃ ⊢ : Hp . ⊃ . Qʻʻʻκ ∈ Cls² excl.
 [✱85·43] ⊃ . ∈_ΔʻP_Δ ʻʻQʻʻʻκ sm P_Δ ʻsʻQʻʻʻκ .
 [✱40·38] ⊃ . ∈_ΔʻP_Δ ʻʻQʻʻʻκ sm P_Δ ʻQʻʻsʻκ : ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·651 -/
/- PM-VERBATIM-BEGIN PM2:✱116·652
✱116·652. Specialization of ✱116·651 to membership.
PM-VERBATIM-END PM2:✱116·652 -/
/- PM-VERBATIM-BEGIN PM2:✱116·653
✱116·653. ⊢ : κ∈Cls² excl .⊃. α↓,,ʻʻʻκ∈Cls² arithm

Dem.
 ⊢ . ✱113·105 . ✱84·53 . ⊃ ⊢ : Hp . ∃ ! α . ⊃ . α ↓_,,ʻʻʻκ ∈ Cls² excl (1)
 ⊢ . ✱113·111 . ⊃ ⊢ . α ↓_,,ʻʻsʻκ ∈ Cls² excl .
 [✱40·38] ⊃ ⊢ . sʻα ↓_,,ʻʻʻκ ∈ Cls² excl . (2)
 ⊢ . ✱113·112·113 . ⊃ ⊢ :. α = Λ . ⊃ : β ∈ κ . ∃ ! β . ⊃ . α ↓_,,ʻʻβ = ι ʻΛ :
 β ∈ κ . β = Λ . ⊃ . α ↓_,,ʻʻβ = Λ (3)
 ⊢ . (3) . ⊃ ⊢ :. α = Λ . ⊃ : α ↓_,,ʻʻʻκ ⊂ ι ʻι ʻΛ ∪ ι ʻΛ :
 [✱24·43·561] ⊃ : ρ , σ ∈ α ↓_,,ʻʻʻκ . ∃ ! ρ ∩ σ . ⊃ . ρ , σ ∈ ι ʻι ʻΛ .
 [✱51·15] ⊃ . ρ = σ :
 [✱84·11] ⊃ : α ↓_,,ʻʻʻκ ∈ Cls² excl (4)
 ⊢ . (1) . (4) . ⊃ ⊢ : Hp . ⊃ . α ↓_,,ʻʻʻκ ∈ Cls² excl (5)
 ⊢ . (2) . (5) . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·653 -/
/- PM-VERBATIM-BEGIN PM2:✱116·654
✱116·654. ⊢ : κ∈Cls² excl .⊃. Prodʻ(α exp)ʻʻκ sm α exp(sʻκ)

Dem.
 ⊢ .*38·13.(✱116·01).⊃ ⊢ .Prodʻ(α exp )ʻʻκ = ProdʻProdʻʻα ↓_,,ʻʻʻκ (1)
 ⊢ .(1).*116·653.*115·34.⊃
 ⊢ .{Prodʻ(α exp )ʻʻκ } sm {Prodʻsʻα ↓_,,ʻʻʻκ} (2)
 ⊢ .(2).*40·38.(✱116·01).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·654 -/
/- PM-VERBATIM-BEGIN PM2:✱116·655
✱116·655. ⊢ : κ∈Cls² excl .⊃. ΠNcʻ(α exp)ʻʻκ=(Ncʻα)^(ΣNcʻκ)
PM-VERBATIM-END PM2:✱116·655 -/
/- PM-VERBATIM-BEGIN PM2:✱116·656
✱116·656. ⊢ : ∃!(α exp β)∩(α exp γ) .⊃. β=γ

Dem.
 ⊢ .*116·11.*52·16.⊃
 ⊢ :. μ ∈ (α exp β )∩ (α exp γ ). ⊃ :y∈ β .⊃ .(∃ x).x∈ α .x↓ y∈ μ :μ ⊂ γ × α :
 [✱113·101] ⊃ :y∈ β .⊃ .(∃ x).x∈ α .x↓ y∈ μ :x↓ y∈ μ .⊃ .y∈ γ :
 [Syll] ⊃ :y∈ β .⊃ .(∃ x).x∈ α .x↓ y∈ μ .y∈ γ .
 [✱10·35] ⊃ .y∈ γ (1)
 Similarly ⊢ :. μ ∈ α exp β ∩ α exp γ .⊃ :y∈ γ .⊃ .y∈ β (2)
 ⊢ .(1).(2).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·656 -/
/- PM-VERBATIM-BEGIN PM2:✱116·657
✱116·657. ⊢ . (α exp)ʻʻκ∈Cls² excl
PM-VERBATIM-END PM2:✱116·657 -/
/- PM-VERBATIM-BEGIN PM2:✱116·658
✱116·658. ⊢ . α exp(∈↧β)=|(Cnvʻ↓β)∈ʻʻ(α exp β)

Dem.
 ⊢ .*116·602·604.*37·401.⊃ ⊢ .{| (Cnvʻ↓ β )}_∈ʻʻ(α exp β ) = α exp (β ↓_,,β )
 [✱85·601] = α exp (∈ ↧β ).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·658 -/
/- PM-VERBATIM-BEGIN PM2:✱116·659
✱116·659. Definition of T transporting exponentials along membership fibres.

Dem.
 ⊢ .*40·4. ⊃ ⊢ :Hp. ⊃ .ᗡʻT = sʻ(α exp )ʻʻκ (1)
 ⊢ .*21·33.⊃ ⊢ :. Hp. ⊃ :ν Tμ .ϖ Tμ .⊃ .
 (∃ β ,γ ).β ,γ ∈ κ .μ ∈ α exp β .μ ∈ α exp γ .
 ν = | (Cnvʻ↓ β )ʻʻμ .ϖ = | (Cnvʻ↓ γ )ʻʻμ .
 [✱116·656] ⊃ .(∃ β ,γ ).β = γ .ν = | (Cnvʻ↓ β )ʻʻμ .ϖ = | (Cnvʻ↓ γ )ʻʻμ .
 [✱13·195] ⊃ .ν = ϖ (2)
 ⊢ .*21·33. ⊃ ⊢ :. Hp.⊃ :ϖ Tμ .ϖ Tν .⊃ .
 (∃ β ,γ ).β ,γ ∈ κ .μ ∈ α exp β .ν ∈ α exp γ .
 ϖ = | (Cnvʻ↓ β )ʻʻμ = | (Cnvʻ↓ γ )ʻʻν .
 [✱116·658] ⊃ .(∃ β ,γ ).β ,γ ∈ κ .μ ∈ α exp β .ν ∈ α exp γ .
 ϖ = | (Cnvʻ↓ β )ʻʻμ = | (Cnvʻ↓ γ )ʻʻν .
 ϖ ∈ α exp (∈ ↧β )∩ α exp (∈ ↧γ ).
 [✱116·656] ⊃ .(∃ β ,γ ).β ,γ ∈ κ .| (Cnvʻ↓ β )ʻʻμ = | (Cnvʻ↓ γ )ʻʻν .
 ∈ ↧β = ∈ ↧γ .
 [✱85·601] ⊃ .(∃ β ).β ∈ κ .| (Cnvʻ↓ β )ʻʻμ = | (Cnvʻ↓ β )ʻʻν .
 [✱116·601.*72·441] ⊃ .μ = ν (3)
 ⊢ .(2).(3). ⊃ ⊢ :Hp.⊃ .T∈ 1 arrow 1 (4)
 ⊢ .*116·658. ⊃ ⊢ :. Hp.⊃ :β ∈ κ .⊃ .Tʻʻ(α exp β ) = α exp (∈ ↧β ):
 [✱37·69] ⊃ :τ _∈ ʻʻ(α exp )ʻʻκ = (α exp )ʻʻ∈ ↧ʻʻκ (5)
 ⊢ .(1).(4).(5).*111·1 .⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·659 -/
/- PM-VERBATIM-BEGIN PM2:✱116·66
✱116·66. ⊢ . Prodʻ(α exp)ʻʻκ sm {α exp(Σʻκ)}

Dem.
 ⊢ .*116·659.*115·51. ⊃ ⊢ .Prodʻ(α exp )ʻʻκ sm Prodʻ(α exp )ʻʻ∈ ↧ʻʻκ (1)
 ⊢ .*85·61.*116·654. ⊃ ⊢ .Prodʻ(α exp )ʻʻ∈ ↧ʻʻκ sm {α exp (sʻ∈ ↧ʻʻκ )} (2)
 ⊢ .(1).(2).*112·1. ⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·66 -/
/- PM-VERBATIM-BEGIN PM2:✱116·661
✱116·661. ⊢ . ΠNcʻ(α exp)ʻʻκ=(Ncʻα)^(ΣNcʻκ)
PM-VERBATIM-END PM2:✱116·661 -/
/- PM-VERBATIM-BEGIN PM2:✱116·67
✱116·67. Indexed images of a disjoint family form an arithmetical third-order class.

Dem.
 ⊢ .*20·3 .⊃ ⊢ : Hp.λ ,μ ∈ ρ .∃ !λ ∩ μ .⊃ .
 (∃ α ,β ).α ,β ∈ κ .λ = α ↓_,,ʻʻγ .μ = β ↓_,,ʻʻγ .∃ !λ ∩ μ .
 [✱37·6] ⊃ .(∃ α ,β ,z,w).α ,β ∈ κ .z,w∈ γ .α ↓_,,z = β ↓_,,w.λ = α ↓_,,ʻʻγ .
 μ = β ↓_,,ʻʻγ .
 [✱55·262.*38·2] ⊃ .(∃ α ,z,w).α ∈ κ .z,w∈ γ .λ = α ↓_,,ʻʻγ .μ = α ↓_,,ʻʻγ .
 [✱13·172] ⊃ .λ =μ (1)
 ⊢ .*37·6.*40·11.⊃
 ⊢ :Hp.ξ ,η ∈ sʻρ .∃ !ξ ∩ η .⊃ .
 (∃ α ,β ,z,w).α ,β ∈ κ .z,w∈ γ .ξ = α ↓_,,z.η = β ↓_,,w.∃ !ξ ∩ η .
 [✱55·232.*38·2] ⊃ .(∃ α ,β ,z).α ,β ∈ κ .z∈ γ .ξ = α ↓_,,z.η = β ↓_,,z.∃ !α ∩ β (2)
 ⊢ .(2).*84·11.⊃
 ⊢ :Hp.κ ∈ Cls² excl.ξ ,η ∈ sʻρ .∃ !ξ ∩ η . ⊃ .(∃ α ,β ,z).ξ = α ↓_,,z.η = β ↓_,,z.α = β .
 [✱13·195·172] ⊃ :ξ = η (3)
 ⊢ .(1).(3).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·67 -/
/- PM-VERBATIM-BEGIN PM2:✱116·671
✱116·671. ⊢ : Hp ✱116·67 .⊃. sʻρ=sʻσ

Dem.
 ⊢ . ✱40·11 . ⊃ ⊢ :. Hp ✱116·67 . ⊃ : ξ ∈ sʻρ . ≡ . (∃ α ) . α ∈ κ . ξ ∈ α ↓_,, ʻʻγ .
 [✱38·3] ≡ . (∃ α , z) . α ∈ κ . z ∈ γ . ξ = ↓ zʻʻα .
 [✱37·103] ≡ . (∃ z) . z ∈ γ . ξ ∈ ↓ zʻʻʻκ .
 [✱40·11] ≡ . ξ ∈ sʻμ̂{(∃ z) . z ∈ γ . μ = ↓ zʻʻʻκ} :.
 ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·671 -/
/- PM-VERBATIM-BEGIN PM2:✱116·672
✱116·672. ⊢ : Hp ✱116·671 .⊃. σ∈Cls² excl

Dem.
 ⊢ . ✱37·103 . ⊃ ⊢ : Hp . μ , ν ∈ σ . ∃ ! μ ∩ ν . ⊃ .
 (∃ z, w, α , β ) . z, w ∈ γ . α , β ∈ κ . ↓ zʻʻα = ↓ wʻʻβ .
 μ = ↓ zʻʻʻα . ν = ↓ wʻʻʻβ .
 [✱55·262] ⊃ . (∃ z, w, α ) . z, w ∈ γ . α ∈ κ . ↓ zʻʻα = ↓ wʻʻα .
 μ = ↓ zʻʻʻα . ν = ↓ wʻʻʻα .
 [✱113·105 . ✱38·2 . Hp] ⊃ . (∃ z, α ) . μ = ↓ zʻʻʻα . ν = ↓ zʻʻʻα .
 [✱13·172] ⊃ . μ = ν : ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·672 -/
/- PM-VERBATIM-BEGIN PM2:✱116·673
✱116·673. ⊢ : Hp ✱116·672 .⊃. ∈Δʻ(exp γ)ʻʻκ sm ∈Δʻ∈Δʻʻσ

Dem.
 ⊢ . ✱38·131 . (✱116·01) . ⊃ ⊢ . ∈_Δʻ( exp γ )ʻʻκ = ∈_Δʻξ̂ {(∃ α ) . α ∈ κ . ξ = Prodʻα ↓_,, ʻʻγ}
 [✱37·6] = ∈_ΔʻProdʻʻλ̂ {(∃ α ) . α ∈ κ . λ = α ↓_,, ʻʻγ} (1)
 ⊢ . (1) . ✱115·33 . ✱116·67 . ⊃
 ⊢ : Hp . ⊃ . ∈_Δʻ( exp γ )ʻʻκ sm ∈_Δʻsʻλ̂ {(∃ α ) . α ∈ κ . λ = α ↓_,, ʻʻγ} .
 [✱116·671] ⊃ . ∈_Δʻ( exp γ )ʻʻκ sm ∈_Δʻsʻσ .
 [✱85·44 . ✱116·672] ⊃ . ∈_Δʻ( exp γ )ʻʻκ sm ∈_Δʻ∈_Δʻʻσ : ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·673 -/
/- PM-VERBATIM-BEGIN PM2:✱116·674
✱116·674. Definition and one-one property of the family M.

Dem.
 ⊢ . ✱30·3 . ⊃ ⊢ : Hp . ⊃ . Mʻz = (↓ z) ∥ Cnvʻ(↓ z)_∈ (1)
 ⊢ . ✱72·184 . ✱111·14 . ⊃ ⊢ . ↓ z ↾ κ ∈ (↓ zʻʻʻκ ) sm ̅ sm ̅ κ .
 [✱114·51] ⊃ ⊢ . ↓ z ∥ Cnvʻ(↓ z)_∈ ↾ ∈_Δʻκ ∈ (∈_Δʻ ↓ zʻʻʻκ ) sm ̅ (∈_Δʻκ ) (2)
 ⊢ . (1) . (2) . ✱73·03 . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·674 -/
/- PM-VERBATIM-BEGIN PM2:✱116·675
✱116·675. Distinct fibres of M have disjoint images.

Dem.
 ⊢ . ✱116·674 . ⊃ ⊢ :. Hp . ⊃ : ∃ ! (Mʻw)ʻʻ∈_Δʻκ ∩ (Mʻv)ʻʻ∈_Δʻκ . ⊃ .
 ∃ ! ∈_Δʻ ↓ wʻʻʻκ ∩ ∈_Δʻ ↓ vʻʻʻκ .
 [✱80·32] ⊃ . ↓ wʻʻʻκ = ↓ vʻʻʻκ .
 [✱40·38] ⊃ . ↓ wʻʻsʻκ = ↓ vʻʻsʻκ .
 [✱113·105 . ✱38·2] ⊃ . w = v :. ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·675 -/
/- PM-VERBATIM-BEGIN PM2:✱116·676
✱116·676. ⊢ . ProdʻDʻʻ↾(∈Δʻκ)ʻʻMʻʻγ sm(∈Δʻκ) exp γ

Dem.
 ⊢ . ✱116·674·675 . ✱116·45 ∈Δʻκ,γ/γ,δ. ⊃
 ⊢ : Hp . ⊃ . ProdʻDʻʻ ↾ (∈_Δʻκ )ʻʻMʻʻγ sm (∈_Δʻκ ) exp γ (1)
 ⊢ . ✱116·674 . ⊃ ⊢ : Hp . ⊃ . Dʻʻ ↾ (∈_Δʻκ )ʻʻMʻʻγ = μ̂ {(∃ z) . z ∈ γ . μ = ∈_Δʻ ↓ zʻʻʻκ}
 [✱37·6 . Hp] = ∈_Δʻʻσ (2)
 ⊢ . (1) . (2) . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·676 -/
/- PM-VERBATIM-BEGIN PM2:✱116·68
✱116·68. ⊢ : κ∈Cls² excl .⊃. ∈Δʻ(exp γ)ʻʻκ sm(∈Δʻκ) exp γ

Dem.
 ⊢ . ✱115·12 . ✱84·55 . ⊃ ⊢ . Prodʻ∈_Δʻʻσ sm ∈_Δʻ∈_Δʻʻσ (1)
 ⊢ . (1) . ✱116·673·676 . ⊃
 ⊢ : Hp . Λ ∼ ∈ κ . ∃ ! sʻκ . ⊃ . ∈_Δʻ(exp γ)ʻʻk sm (∈_Δʻκ ) exp γ (2)
 ⊢ . ✱53·24 . ⊃ ⊢ : Λ ∼ ∈ κ . ∼ ∃ ! sʻκ . ⊃ . κ = Λ .
 [✱83·15 . ✱116·33] ⊃ . ∈_Δʻ(exp γ )ʻʻκ = ι ʻΛ̇ . (∈_Δʻκ ) exp γ ∈ 1 .
 [✱73·45] ⊃ . ∈_Δʻ(exp γ )ʻʻκ sm (∈_Δʻκ ) exp γ (3)
 ⊢ . ✱83·11 . ✱116·182 . ⊃ ⊢ : Λ ∈ κ . ∃ ! γ . ⊃ . ∈_Δʻκ = Λ . Λ ∈ (exp γ )ʻʻκ .
 [✱116·182 . ✱83·11] ⊃ . (∈_Δʻκ ) exp γ = Λ . ∈_Δʻ(exp γ )ʻʻκ = Λ (4)
 ⊢ . ✱116·181 . ⊃ ⊢ : Λ ∈ κ . γ = Λ . ⊃ . (∈_Δʻκ ) exp γ = ι ʻΛ (5)
 ⊢ . ✱116·181 . ⊃ ⊢ : Λ ∈ κ . γ = Λ . ⊃ . (exp γ )ʻʻκ = ι ʻι ʻΛ .
 [✱83·41] ⊃ . ∈_Δʻ(exp γ )ʻʻκ sm ι ʻΛ (6)
 ⊢ . (4) . (5) . (6) . ⊃ ⊢ : Λ ∈ κ . ⊃ . ∈_Δʻ(exp γ )ʻʻκ sm (∈_Δʻκ ) exp γ (7)
 ⊢ . (2) . (3) . (7) . ✱114·1 . ✱116·25 . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·68 -/
/- PM-VERBATIM-BEGIN PM2:✱116·7
✱116·7. ⊢ . Ncʻ{(ιʻΛ∪ιʻV)↑α}Δʻα=2^(Ncʻα)

Dem.
 ⊢ . ✱24·1 .*101·3 . ⊃ ⊢ . Ncʻ(ι ʻΛ ∪ ι ʻV) = 2 (1)
 ⊢ . ✱116·15 . ⊃ ⊢ . Ncʻ(ι ʻΛ ∪ ι ʻV) ↑ α _Δ ʻα = Ncʻ{(ι ʻΛ ∪ ι ʻV) exp α}
 [✱116·25] = Ncʻ(ι ʻΛ ∪ ι ʻV)^Ncʻα
 [(1)] = 2^Ncʻα . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·7 -/
/- PM-VERBATIM-BEGIN PM2:✱116·71
✱116·71. ⊢ : R∈{(ιʻΛ∪ιʻV)↑α}Δʻα .⊃. converse RʻV=α−converse RʻΛ

Dem.
 ⊢ . ✱116·12 . ⊃ ⊢ : Hp . ⊃ . R ∈ 1 arrow Cls . DʻR ⊂ ι ʻΛ ∪ ι ʻV . ᗡʻR = α (1)
 [✱37·271] ⊃ . α = Ř ʻʻ(ι ʻΛ ∪ ι ʻV)
 [✱53·302] = R⃖ʻΛ ∪ R⃖ʻV (2)
 ⊢ . (1) . ✱71·18 . ⊃ ⊢ : Hp . ⊃ . R⃖ʻΛ ∩ R⃖ʻV = Λ (3)
 ⊢ . (2) . (3) . ✱24·47 . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·71 -/
/- PM-VERBATIM-BEGIN PM2:✱116·711
✱116·711. ⊢ : R,S∈{(ιʻΛ∪ιʻV)↑α}Δʻα . converse RʻΛ=converse SʻΛ .⊃. R=S

Dem.
 ⊢ . ✱116·71 . ⊃ ⊢ : Hp . ⊃ . R⃖ʻV = S⃖ʻV (1)
 ⊢ . (1) . ✱116·12 . ⊃ ⊢ :. Hp . ⊃ : γ ∈ DʻR ∪ DʻS . ⊃ _γ . R⃖ʻγ = S⃖ʻγ :
 [✱33·48] ⊃ : R = S :. ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·711 -/
/- PM-VERBATIM-BEGIN PM2:✱116·712
✱116·712. Definition of T sending a characteristic relation to its Λ-fibre.

Dem.
 ⊢ . ✱21·33 . ⊃ ⊢ :: Hp . ⊃ :. R ∈ (ι ʻΛ ∪ ι ʻV) ↑ α _Δ ʻα . ⊃ : μ TR . ≡ _μ . μ = R⃖ʻΛ :
 [✱30·3] ⊃ : TʻR = R⃖ʻΛ (1)
 ⊢ . (1) . ✱14·21 . ⊃ ⊢ :. Hp . ⊃ : R ∈ (ι ʻΛ ∪ ι ʻV) ↑ α _Δ ʻα . ⊃ . E! TʻR .
 [✱33·43] ⊃ . R ∈ ᗡʻT (2)
 ⊢ . ✱21·33 . ✱33·131 . ⊃ ⊢ : Hp . ⊃ · ᗡʻT ⊂ (ι ʻΛ ∪ ι ʻV) ↑ α _Δ ʻα (3)
 ⊢ (1) . (2) . (3) . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·712 -/
/- PM-VERBATIM-BEGIN PM2:✱116·713
✱116·713. ⊢ : Hp ✱116·712 .⊃. T∈1→1

Dem.
 ⊢ . ✱116·712 . ✱14·21 . ⊃ ⊢ :. Hp . ⊃ : R ∈ ᗡʻT . ⊃ . E! TʻR :
 [✱71·16] ⊃ : R ∈ 1 arrow Cls (1)
 ⊢ . ✱116·712·711 . ⊃ ⊢ :. Hp . ⊃ : R, S ∈ ᗡʻT . TʻR = TʻS . ⊃ . R = S (2)
 ⊢ . (1) . (2) . ✱71·55 . ⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·713 -/
/- PM-VERBATIM-BEGIN PM2:✱116·714
✱116·714. T is onto the class of subclasses of α.

Dem.
 ⊢ . ✱21·33 . ✱33·13 . ⊃ ⊢ :. Hp . ⊃ : γ ∈ DʻR . ⊃ . γ ∈ ι ʻΛ ∪ ι ʻV (1)
 ⊢ . ✱21·33 . ✱33·131 . ⊃ ⊢ :: Hp . ⊃ :. x ∈ ᗡʻR . ≡ :
 (∃ γ ) : γ = Λ . x ∈ μ . ∨ . γ = V . x ∈ α - μ :
 [✱10·42 . ✱13·19] ≡ : x ∈ μ . ∨ . x ∈ α - μ : (2)
 [✱24·411 . Hp] ≡ : x ∈ α (3)
 ⊢ .*21·33.*30·3. ⊃ ⊢ :. Hp.⊃ :x∈ μ .⊃ ₓ.Rʻx=Λ :x∈ α -μ .⊃ ₓ.Rʻx =V:
 [(2).*14·21] ⊃ :x∈ ᗡʻR.⊃ ₓ.E!Rʻx:
 [✱71·16] ⊃ :R∈ 1 arrow Cls (4)
 ⊢ .*21·33. ⊃ ⊢ :: Hp.⊃ :. γ =Λ .⊃ :γ Rx.≡ ₓ.x∈ μ :
 [✱32·181] ⊃ :R⃖ʻγ =μ (5)
 ⊢ .(1).(3).(4).*116·12. ⊃ ⊢ :Hp.⊃ .R∈ {(ι ʻΛ ∪ ι ʻV)↑ α}_Δ ʻα (6)
 ⊢ .(5).(6).*116·712. ⊃ ⊢ :Hp.⊃ .μ =TʻR (7)
 ⊢ .(6).(7).⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·714 -/
/- PM-VERBATIM-BEGIN PM2:✱116·715
✱116·715. ⊢ : Hp ✱116·712 .⊃. DʻT=Clʻα

Dem.
 ⊢ .*116·714.*33·43. ⊃ ⊢ :Hp.⊃ .Clʻα ⊂ DʻT (1)
 ⊢ .*21·33. ✱33·13.⊃
 ⊢ :. Hp. ⊃ :μ ∈ DʻT.⊃ .(∃ R).R∈ (ι ʻΛ ∪ ι ʻV)↑ α _Δ ʻα .μ =R⃖ʻΛ .
 [✱33·151] ⊃ .(∃ R).R∈ (ι ʻΛ ∪ ι ʻV)↑ α _Δ ʻα .μ ⊂ ᗡʻR.
 [✱80·14] ⊃ .μ ⊂ α (2)
 ⊢ .(1).(2).⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·715 -/
/- PM-VERBATIM-BEGIN PM2:✱116·72
✱116·72. ⊢ . NcʻClʻα=2^(Ncʻα)

Dem.
 ⊢ .*116·712·713·715.⊃ ⊢ .Clʻα sm {(ι ʻΛ ∪ ι ʻV)↑ α}_Δ ʻα (1)
 ⊢ .(1).*116·7.⊃ ⊢ . Prop
PM-VERBATIM-END PM2:✱116·72 -/
/- PM-VERBATIM-BEGIN PM2:✱116·8
✱116·8. ⊢ . Rlʻ(ρ↑σ)=ṡʻʻClʻ(σ×ρ)

Dem.
 ⊢ .*60·2. ⊃ ⊢ :. R∈ ṡ ʻʻClʻ(σ xρ ).≡ :(∃ λ ).λ ⊂ σ × ρ .R=ṡ ʻλ :
 [✱113·101] ≡ :(∃ λ ):P∈ λ .⊃ _P.(∃ x,y).x∈ ρ .y∈ σ .P=x↓ y:R=ṡ ʻλ :
 [✱41·11] ≡ :(∃ λ ):P∈ λ .⊃ _P.(∃ x,y).x∈ ρ .y∈ σ .P=x↓ y:
 uRv.≡ u,v.(∃ P).P∈ λ .uPv:
 [✱10·56] ⊃ :uRv.⊃ u,v.(∃ x,y).x∈ ρ .y∈ σ .u(x↓ y)v:
 [✱55·13] ⊃ :uRv.⊃ u,v.u∈ ρ .v∈ σ :
 [✱35·103]. ⊃ :R ⪽ ρ ↑ σ (1)
 ⊢ .*35·103.*113·101.⊃
 ⊢ :R ⪽ ρ ↑ σ .λ =P̂ {(∃ x,y).xRy.P=x↓ y}.⊃ .λ ⊂ σ × ρ (2)
 ⊢ .*41·11.*13·195.⊃
 ⊢ :. Hp(2).⊃ :u(ṡ ʻλ )v. ≡ .(∃ x,y).xRy.u(x↓ y)v.
 [✱55·13] ≡ .uRv (3)
 ⊢ .(2).(3). ⊃ ⊢ :R ⪽ ρ ↑ σ .⊃ .(∃ λ ).λ ⊂ σ × ρ .R=ṡ ʻλ (4)
 ⊢ .(1).(4). ⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·8 -/
/- PM-VERBATIM-BEGIN PM2:✱116·81
✱116·81. ⊢ . ṡ↾Clʻ(σ×ρ)∈1→1

Dem.
 ⊢ .*41·13. ⊃ ⊢ :. α ,β ∈ Clʻ(σ × ρ ).ṡ ʻα =ṡ ʻβ .x↓ y∈ α .⊃ :x↓ y ⪽ ṡ ʻβ :
 [✱41·11] ⊃ :(∃ P).P∈ β .x↓ y ⪽ P:
 [✱113·101.Hp] ⊃ :(∃ P,u,v).P∈ β .P=u↓ v.x↓ y ⪽ u↓ v:
 [✱55·134·34] ⊃ :(∃ P,u,v).P∈ β .P=u↓ v.x↓ y=u↓ v:
 [✱13·172·13] ⊃ :x↓ y∈ β (1)
 ⊢ .(1)β, α/α, β. ⊃ ⊢ :α ,β ∈ Clʻ(σ × ρ ).ṡ ʻα =ṡ ʻβ .x↓ y∈ β .⊃ .x↓ y∈ α (2)
 ⊢ .(1).(2).*113·101. ⊃ ⊢ :α ,β ∈ Clʻ(σ × ρ ).ṡ ʻα =ṡ ʻβ .⊃ .α =β (3)
 ⊢ .(3).*71·55.*72·163.⊃ ⊢ .Prop
PM-VERBATIM-END PM2:✱116·81 -/
/- PM-VERBATIM-BEGIN PM2:✱116·82
✱116·82. ⊢ . Rlʻ(ρ↑σ) sm Clʻ(σ×ρ)
PM-VERBATIM-END PM2:✱116·82 -/
/- PM-VERBATIM-BEGIN PM2:✱116·83
✱116·83. ⊢ . NcʻRlʻ(ρ↑σ)=2^(Ncʻρ×cNcʻσ)
PM-VERBATIM-END PM2:✱116·83 -/
/- PM-VERBATIM-BEGIN PM2:✱116·9
✱116·9. ⊢ : Ncʻtʻx=μ .⊃. Ncʻt²ʻx=2^μ
PM-VERBATIM-END PM2:✱116·9 -/
/- PM-VERBATIM-BEGIN PM2:✱116·901
✱116·901. ⊢ : Ncʻt₀ʻα=μ .⊃. Ncʻtʻα=2^μ
PM-VERBATIM-END PM2:✱116·901 -/
/- PM-VERBATIM-BEGIN PM2:✱116·91
✱116·91. ⊢ : Ncʻt₀ʻα=μ .⊃. Ncʻt₀₀ʻα=2^(μ²)
PM-VERBATIM-END PM2:✱116·91 -/
/- PM-VERBATIM-BEGIN PM2:✱116·92
✱116·92. ⊢ : Ncʻt₀ʻα=μ .⊃. Ncʻt₀¹ʻα=2^(μ×c2^μ) . Ncʻt¹¹ʻα=2^(2^μ×c2^μ) . etc.
PM-VERBATIM-END PM2:✱116·92 -/
