namespace PM.FirstEdition.Volume2.Star126Source
def records : List (String × String) := [
  ("✱126·01", "NC ind = NC induct − ιʻΛ  Df"),
  ("✱126·011", "⊢ : ν ∈ NC ind .≡. ν ∈ NC induct − ιʻΛ"),
  ("✱126·12", "⊢ : ν ∈ NC ind .⊃. (ν +c 1) ∩ tʻν ∈ NC ind"),
  ("✱126·121", "⊢ . 1,2,3,… ∈ NC ind"),
  ("✱126·13", "⊢ : α,β ∈ NC ind .⊃. α +c β ∈ NC ind"),
  ("✱126·14", "⊢ : α,β ∈ NC ind .⊃. α ×c β ∈ NC ind"),
  ("✱126·15", "⊢ : α,β ∈ NC ind .⊃. α^β ∈ NC ind"),
  ("✱126·141", "⊢ : α,β ∈ NC ind−ιʻ0 .≡. α ×c β ∈ NC ind−ιʻ0"),
  ("✱126·31", "⊢ : α +c 1 ∈ NC ind .≡. α ∈ NC ind"),
  ("✱126·41", "⊢ :: μ,ν,π ∈ NC ind . π ≠ 0 .⊃ : μ ×c π = ν ×c π .≡. μ = ν"),
  ("✱126·5", "⊢ :: μ,ν,π ∈ NC ind .⊃ : μ +c π = ν +c π .≡. μ = ν"),
  ("✱126·51", "⊢ :: μ,ν,π ∈ NC ind . π ≠ 0 .⊃ : μ ×c π > ν ×c π .≡. μ > ν"),
  ("✱126·52", "⊢ :: μ,ν,π ∈ NC ind . π ≠ 0 .⊃ : μ^π > ν^π .≡. μ > ν"),
  ("✱126·53", "⊢ :: μ,ν,π ∈ NC ind . π ≠ 0 . π ≠ 1 .⊃ : π^μ > π^ν"),
  ("✱126·32", "⊢ : α ∈ NC−ιʻ0−ιʻΛ . ν ∈ NC ind .⊃. α +c ν > ν"),
  ("✱126·4", "⊢ :: μ,ν,π ∈ NC ind .⊃ : μ +c π = ν +c π .≡. μ = ν"),
  ("✱126·42", "⊢ :: μ,ν,π ∈ NC ind . π ≠ 0 .⊃ : μ^π = ν^π .≡. μ = ν"),
  ("✱126·43", "⊢ :: μ,ν,π ∈ NC ind . π ≠ 0 . π ≠ 1 .⊃ : π^μ = π^ν .≡. μ = ν")]
  ++ [
  ("✱126·33", "⊢ :: α ∈ NC ind . β ∈ NC−ιʻΛ .⊃ : α<β .∨. α=β .∨. α>β"),
  ("✱126·151", "⊢ : α,β ∈ NC ind−ιʻ0 . α≠1 .≡. α^β ∈ NC ind−ιʻ0−ιʻ1")]
end PM.FirstEdition.Volume2.Star126Source
